<img src="FINAL_ER.jpg">

<img src="FINAL_RELATIONAL_SCHEMA.jpg">

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:admin@localhost/  --make sure user is root and password is admin

In [3]:
%%sql
DROP DATABASE IF EXISTS READYHOLS;

 * mysql+pymysql://root:***@localhost/
18 rows affected.

[]

In [4]:
%%sql
CREATE DATABASE READYHOLS;
USE READYHOLS;

CREATE TABLE user(
    user_id      char(9) not null ,
    username     varchar(30),
    password     varchar(1024),
    email        varchar(30),
    plan_type    char(10),
    sub_mail     boolean,
    share_drive  boolean,
    grp_count    integer,
    upg_count    integer,
    primary key (user_id)
);

CREATE TABLE vacation(
    vac_id       char(9) not null ,
    description  char(50),
    vac_grp_id   char(9),
    upg_user_id  char(9),
    start_date   date,
    end_date     date,
    budget_limit integer,
    primary key (vac_id),
    foreign key (upg_user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE vacation_grp(
    vac_grp_id   char(9) not null ,
    grp_name     varchar(50),
    vac_grp_pin  varchar(1024),
    primary key (vac_grp_id)
);

CREATE TABLE vac_user_in(
    vac_grp_id   char(9) not null,
    user_id      char(9) not null,
    primary key (vac_grp_id,user_id),
    foreign key (vac_grp_id) references vacation_grp(vac_grp_id) on update cascade on delete cascade,
    foreign key (user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE budget(
    vac_id       char(9) not null,
    budget_id    char(9) not null,
    category     varchar(30),
    expenditure  integer,
    remarks      text,
    primary key (vac_id,budget_id),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE album(
    alb_id       char(9) not null ,
    alb_name     varchar(50),
    alb_date     date,
    vac_id       char(9) not null,
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    primary key (alb_id)
);

CREATE TABLE photo(
    photo_id     char(9) not null ,
    photolink    varchar(1024),
    alb_id       char(9),
    primary key (photo_id),
    foreign key (alb_id) references album(alb_id) on update cascade on delete cascade
);

CREATE TABLE booking(
    vac_id       char(9) not null ,
    ref_no       varchar(30),
    booking_type varchar(30),
    description  text,
    attachment   varchar(1024),
    primary key (vac_id,ref_no),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE itinerary(
    vac_id       char(9) not null ,
    day_no       integer not null,
    itin_time    time not null,
    itin_type    varchar(30),
    description  varchar(100),
    location     varchar(50),
    primary key (vac_id, day_no, itin_time),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE destination(
    dest_id      char(9) not null,
    country      varchar(50),
    state        varchar(50),
    primary key (dest_id)
);

CREATE TABLE has_destination(
    vac_id       char(9) not null,
    dest_id      char(9) not null,
    no_days      integer not null,
    dstart_date  date not null,
    primary key (vac_id, dest_id, no_days, dstart_date),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    foreign key (dest_id) references destination(dest_id) on update cascade on delete cascade
);

CREATE TABLE vac_map(
    map_id       char(9) not null ,
    map_link     varchar(1024),
    name         varchar(50),
    category     varchar(30),
    primary key (map_id)
);

CREATE TABLE ref_map_itin(
    vac_id       char(9) not null ,
    itin_time    time not null,
    day_no       integer not null,
    map_id       char(9) not null,
    primary key (vac_id, day_no, itin_time, map_id),
    foreign key (vac_id, day_no, itin_time) references itinerary(vac_id, day_no, itin_time) on update cascade on delete cascade,
    foreign key (map_id) references vac_map(map_id) on update cascade on delete cascade
);


alter table vacation add foreign key(vac_grp_id) references vacation_grp(vac_grp_id) on delete cascade on update cascade;

 * mysql+pymysql://root:***@localhost/
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
grant all privileges on readyhols.* to 'root'@'localhost';
flush privileges;

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

Vacation Grp Pins
(000000001,345677725845)
(000000002,524638776254)
(000000003,296729573058)
(000000004,108394827503)
(000000005,104927684838)
(000000006,234098134099)
(000000007,254235426752)
(000000008,425435345344)
(000000009,254533453435)
(000000010,352534534534)


User Credentials
(Anna,12345678)
(Benny,abcdefgh)
(Charlie,56789012)
(Daniel,DANIEL12)
(Elliot,iLoveCSS)
(Francis,56789012)
(Daisy,13579120)
(Oliver,25345423)
(James,35423455442)
(Lily,4532dfsd34)
(Zachary,gfasf3144)
(Timothy,SGDFD2353253)
(Nicholas,245224gGSGS23)
(Kenneth,1435SFFS)
(Ryan,13414FSESF)

In [6]:
%%sql
INSERT INTO user VALUES ('000000001', 'Anna', 'pbkdf2:sha256:260000$Jxu38JhpUtj2KORr$55d32b66ff58895a05b949a82c6f36b99155a1756c979c958cd5ba9768b4e277', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 5, 0);
INSERT INTO user VALUES ('000000002', 'Benny', 'pbkdf2:sha256:260000$Mcpq3Myee1i5bCtT$ba786e92ef49008cd901eaea9f4c3755ee6744f6e278750b80a73ca12174ef76', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 10, 7);
INSERT INTO user VALUES ('000000003', 'Charlie', 'pbkdf2:sha256:260000$uo8D9nnQq19HeQ9M$c28d7c62fde881951f6df3af255b94b36d430eaa10446545433f8b82705feba3', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 6, 0);
INSERT INTO user VALUES ('000000004', 'Daniel', 'pbkdf2:sha256:260000$JOUbwJQb9uYD3ak4$73083e4b3782fd6e3f3c7cb53993ce7e0e30444ac70d09e8d52c9de55d5950f4', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 7, 1);
INSERT INTO user VALUES ('000000005', 'Elliot', 'pbkdf2:sha256:260000$dFLTKchGWUAW3mAi$9d736306a948c332fa964e32a5ff3512d8ee3ed3f9ad8d39a84b06322ced5d1e', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 4, 0);
INSERT INTO user VALUES ('000000006', 'Francis', 'pbkdf2:sha256:260000$SVcQ1PKIbRUOPCc9$34210b10d536c98190931926489602b549e944b2e55a820ba1958981bca9fbbe', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 7, 1);
INSERT INTO user VALUES ('000000007', 'Daisy', 'pbkdf2:sha256:260000$D5MRjuhsDRGhvF0U$6463e2efa30c5ccd419409fcfe5cea2d2a8184485af491d84e80634240a5a4e6', 'daisy_@nushigh.edu.sg', 'Basic', 0, 1, 3, 0);
INSERT INTO user VALUES ('000000008', 'Oliver', 'pbkdf2:sha256:260000$dMm5M04gRcCVqhvq$b0dd4fb3479c9569b8e661d3de93e30b1ced55f9195b6a414290058a34e1a222', 'oliver_@nushigh.edu.sg', 'Basic', 1, 1, 4, 0);
INSERT INTO user VALUES ('000000009', 'James', 'pbkdf2:sha256:260000$UbeVKUEfIHPgdUqO$1490d1bfe0fca810965894c06721a5a44aa9559900788d723f6a695314c80795', 'james_@nushigh.edu.sg', 'Plus', 1, 0, 5, 2);
INSERT INTO user VALUES ('000000010', 'Lily', 'pbkdf2:sha256:260000$iU5a2hLPbbq0h9qp$ad150a2d245212428c11bceb3bd3a373f108acf6c2b96a0388e2576637ab0887', 'lily_@nushigh.edu.sg', 'Basic', 1, 0, 5, 0);
INSERT INTO user VALUES ('000000011', 'Zachary', 'pbkdf2:sha256:260000$3VXezVtYKD5B98JJ$860bc12e6b9706e3588efbf9b99a7abac079fc25c46b548cbea0edb59946fbf4', 'zachary_@nushigh.edu.sg', 'Premium', 0, 0, 4, 2);
INSERT INTO user VALUES ('000000012', 'Timothy', 'pbkdf2:sha256:260000$p67QeoHkf71JapqV$9284be1a767d01f9a32bb3dba883652a1fc31e6b621b3c87e87da4d7e34420ec', 'timothy_@nushigh.edu.sg', 'Plus', 1, 1, 4, 0);
INSERT INTO user VALUES ('000000013', 'Nicholas', 'pbkdf2:sha256:260000$LnileY33cGTTJ9qL$70a9ae449f158740733a99ba0c8689b2156fbf47e4b72e0df20f10e043db6db0', 'nicholas_@nushigh.edu.sg', 'Basic', 1, 0, 2, 0);
INSERT INTO user VALUES ('000000014', 'Kenneth', 'pbkdf2:sha256:260000$Sk2SjX3o6RdKPfLy$262e12ab3330a73f53aea0a445754f94f83bb21751b44f03dedaabda0f5e61c3', 'kenneth_@nushigh.edu.sg', 'Plus', 0, 1, 5, 3);
INSERT INTO user VALUES ('000000015', 'Ryan', 'pbkdf2:sha256:260000$BA33onvDOmbiuLJY$71e7f6e27605c3a6066f595295d8a0b6c85a285ace531e01afb28a0bd1b3a1c5', 'ryan_@nushigh.edu.sg', 'Basic', 0, 0, 4, 0);

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
INSERT INTO vacation_grp VALUES ('000000001', 'Lee Family', 'pbkdf2:sha256:260000$yVjpAlTNHDLnkaYI$5bf657ad985560ab03969a06305fb3d823757c7058d792e01316da5922145ab9');
INSERT INTO vacation_grp VALUES ('000000002', 'Teoh Family', 'pbkdf2:sha256:260000$teETLSB9xJaY0VeB$58d8cfeaaa1da459f186cd9b5f0a8e2de0d165866e233ee0252e548e7244fbbd');
INSERT INTO vacation_grp VALUES ('000000003', 'Tan Family', 'pbkdf2:sha256:260000$cktvJI8HoWIypb8i$afefc233c4ad296a5e1c76097a41e97a655bd6a101852d8ea005052352bf3cba');
INSERT INTO vacation_grp VALUES ('000000004', 'CS Major Family', 'pbkdf2:sha256:260000$dlfql9wjkNGNSQ1X$d69bc9ef22e24a90b19055322827a8c2ba1cb1f1ee4a9dfa0265b32b55d4e75e');
INSERT INTO vacation_grp VALUES ('000000005', 'OSAP Trip Group', 'pbkdf2:sha256:260000$5TL2ZMPb1LpeGypC$c0884f7b9926d312ee3ebbfdccd19d9bf70437a15d8b155acdc48c14e4b27d77');
INSERT INTO vacation_grp VALUES ('000000006', 'Cluster 12A', 'pbkdf2:sha256:260000$Vu7ni5rPG3TcwUsn$c5c825d27fc2f7229f3e4710fddb96e9d47bcbf2634d5f9041b1755c9db938a0');
INSERT INTO vacation_grp VALUES ('000000007', 'Wong Family', 'pbkdf2:sha256:260000$u6EBic07w9PNTjM7$2d84af2aa481f5c8a56b16fad7efac6c3d7dac75ad9453a15c719445d627e336');
INSERT INTO vacation_grp VALUES ('000000008', 'M23605', 'pbkdf2:sha256:260000$An4DGMpVbdGjFgNe$2f897c09f4f7afdd687a51ae29d1198c3cd1d50bc2ef0cbaa33bbd481b030809');
INSERT INTO vacation_grp VALUES ('000000009', 'Class of 2023', 'pbkdf2:sha256:260000$e5hRpXNPKS1TrgFx$75bf612651527765c87f57f0f7c8c6a30f34ce14929da5b997b63a614deea966');
INSERT INTO vacation_grp VALUES ('000000010', 'Besties', 'pbkdf2:sha256:260000$HgyuZ0oe8JMPHdZD$a10dc526eda9fa1c2411c53d3ea1e0cf898bcff75d8b029437a5f5e75fac5405');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
INSERT INTO vacation VALUES ('000000001', 'Trip to Malaysia', '000000003', null, '2023-02-13', '2023-02-16', 5000);
INSERT INTO vacation VALUES ('000000002', 'Trip to Japan', '000000001', '000000002', '2023-03-29', '2023-04-11', 10000);
INSERT INTO vacation VALUES ('000000003', 'Trip to Germany', '000000002', '000000002', '2023-02-26', '2023-03-10', 10000);
INSERT INTO vacation VALUES ('000000004', 'Trip to USA', '000000005', '000000006', '2023-06-13', '2023-06-20', 20000);
INSERT INTO vacation VALUES ('000000005', 'Trip to Switzerland', '000000005', '000000004', '2024-06-02', '2024-06-20', 25000);
INSERT INTO vacation VALUES ('000000006', 'Trip to Australia', '000000004', '000000002', '2023-05-08', '2023-05-30', 50000);
INSERT INTO vacation VALUES ('000000007', 'Trip to Bangkok', '000000009', '000000011', '2023-04-19', '2023-04-23', 5000);
INSERT INTO vacation VALUES ('000000008', 'Trip to China', '000000008', '000000011', '2023-08-15', '2023-08-23', 23800);
INSERT INTO vacation VALUES ('000000009', 'Trip to Mongolia', '000000003', '000000014', '2023-04-20', '2023-05-05', 2400);
INSERT INTO vacation VALUES ('000000010', 'Trip to UK', '000000006', null, '2023-09-01', '2023-09-16', 123500);
INSERT INTO vacation VALUES ('000000011', 'Trip to Paris', '000000005', '000000009', '2023-11-01', '2023-11-21', 1200);
INSERT INTO vacation VALUES ('000000012', 'Trip to Vietnam', '000000010', '000000002', '2023-10-10', '2023-10-25', 13700);
INSERT INTO vacation VALUES ('000000013', 'Trip to Thailand', '000000003', '000000014', '2023-07-05', '2023-07-25', 6200);
INSERT INTO vacation VALUES ('000000014', 'Trip to Taiwan', '000000008', '000000002', '2024-07-15', '2024-07-30', 3200);
INSERT INTO vacation VALUES ('000000015', 'Trip to India', '000000003', '000000014', '2023-12-10', '2023-12-22', 13400);
INSERT INTO vacation VALUES ('000000016', 'Trip to Cambodia', '000000006', null, '2024-01-01', '2024-02-01', 2100);
INSERT INTO vacation VALUES ('000000017', 'Trip to Laos', '000000007', '000000002', '2024-03-05', '2024-03-13', 10000);
INSERT INTO vacation VALUES ('000000018', 'Trip to Brunei', '000000002', '000000002', '2024-04-01', '2024-04-15', 23400);
INSERT INTO vacation VALUES ('000000019', 'Trip to Indonesia', '000000004', '000000009', '2024-07-01', '2024-07-15', 14200);
INSERT INTO vacation VALUES ('000000020', 'Trip to Canada', '000000008', null, '2024-08-15', '2024-09-01', 1250);

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql
INSERT INTO vac_user_in VALUES ('000000001', '000000001');
INSERT INTO vac_user_in VALUES ('000000003', '000000001');
INSERT INTO vac_user_in VALUES ('000000004', '000000001');
INSERT INTO vac_user_in VALUES ('000000005', '000000001');
INSERT INTO vac_user_in VALUES ('000000007', '000000001');
INSERT INTO vac_user_in VALUES ('000000001', '000000002');
INSERT INTO vac_user_in VALUES ('000000002', '000000002');
INSERT INTO vac_user_in VALUES ('000000003', '000000002');
INSERT INTO vac_user_in VALUES ('000000004', '000000002');
INSERT INTO vac_user_in VALUES ('000000005', '000000002');
INSERT INTO vac_user_in VALUES ('000000006', '000000002');
INSERT INTO vac_user_in VALUES ('000000007', '000000002');
INSERT INTO vac_user_in VALUES ('000000008', '000000002');
INSERT INTO vac_user_in VALUES ('000000009', '000000002');
INSERT INTO vac_user_in VALUES ('000000010', '000000002');
INSERT INTO vac_user_in VALUES ('000000001', '000000003');
INSERT INTO vac_user_in VALUES ('000000004', '000000003');
INSERT INTO vac_user_in VALUES ('000000005', '000000003');
INSERT INTO vac_user_in VALUES ('000000006', '000000003');
INSERT INTO vac_user_in VALUES ('000000010', '000000003');
INSERT INTO vac_user_in VALUES ('000000008', '000000003');
INSERT INTO vac_user_in VALUES ('000000001', '000000004');
INSERT INTO vac_user_in VALUES ('000000002', '000000004');
INSERT INTO vac_user_in VALUES ('000000003', '000000004');
INSERT INTO vac_user_in VALUES ('000000005', '000000004');
INSERT INTO vac_user_in VALUES ('000000006', '000000004');
INSERT INTO vac_user_in VALUES ('000000009', '000000004');
INSERT INTO vac_user_in VALUES ('000000010', '000000004');
INSERT INTO vac_user_in VALUES ('000000002', '000000005');
INSERT INTO vac_user_in VALUES ('000000007', '000000005');
INSERT INTO vac_user_in VALUES ('000000001', '000000005');
INSERT INTO vac_user_in VALUES ('000000005', '000000005');
INSERT INTO vac_user_in VALUES ('000000004', '000000006');
INSERT INTO vac_user_in VALUES ('000000010', '000000006');
INSERT INTO vac_user_in VALUES ('000000001', '000000006');
INSERT INTO vac_user_in VALUES ('000000002', '000000006');
INSERT INTO vac_user_in VALUES ('000000007', '000000006');
INSERT INTO vac_user_in VALUES ('000000009', '000000006');
INSERT INTO vac_user_in VALUES ('000000003', '000000007');
INSERT INTO vac_user_in VALUES ('000000006', '000000007');
INSERT INTO vac_user_in VALUES ('000000007', '000000007');
INSERT INTO vac_user_in VALUES ('000000001', '000000008');
INSERT INTO vac_user_in VALUES ('000000007', '000000008');
INSERT INTO vac_user_in VALUES ('000000008', '000000008');
INSERT INTO vac_user_in VALUES ('000000010', '000000008');
INSERT INTO vac_user_in VALUES ('000000002', '000000009');
INSERT INTO vac_user_in VALUES ('000000004', '000000009');
INSERT INTO vac_user_in VALUES ('000000008', '000000009');
INSERT INTO vac_user_in VALUES ('000000009', '000000009');
INSERT INTO vac_user_in VALUES ('000000005', '000000009');
INSERT INTO vac_user_in VALUES ('000000002', '000000010');
INSERT INTO vac_user_in VALUES ('000000003', '000000010');
INSERT INTO vac_user_in VALUES ('000000008', '000000010');
INSERT INTO vac_user_in VALUES ('000000009', '000000010');
INSERT INTO vac_user_in VALUES ('000000010', '000000010');
INSERT INTO vac_user_in VALUES ('000000004', '000000011');
INSERT INTO vac_user_in VALUES ('000000008', '000000011');
INSERT INTO vac_user_in VALUES ('000000007', '000000011');
INSERT INTO vac_user_in VALUES ('000000009', '000000011');
INSERT INTO vac_user_in VALUES ('000000001', '000000012');
INSERT INTO vac_user_in VALUES ('000000004', '000000012');
INSERT INTO vac_user_in VALUES ('000000003', '000000012');
INSERT INTO vac_user_in VALUES ('000000008', '000000012');
INSERT INTO vac_user_in VALUES ('000000005', '000000013');
INSERT INTO vac_user_in VALUES ('000000010', '000000013');
INSERT INTO vac_user_in VALUES ('000000002', '000000014');
INSERT INTO vac_user_in VALUES ('000000004', '000000014');
INSERT INTO vac_user_in VALUES ('000000003', '000000014');
INSERT INTO vac_user_in VALUES ('000000005', '000000014');
INSERT INTO vac_user_in VALUES ('000000006', '000000014');
INSERT INTO vac_user_in VALUES ('000000003', '000000015');
INSERT INTO vac_user_in VALUES ('000000006', '000000015');
INSERT INTO vac_user_in VALUES ('000000008', '000000015');
INSERT INTO vac_user_in VALUES ('000000010', '000000015');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql
INSERT INTO budget VALUES ('000000001', '000000001', 'FOOD', 100, 'Airport Food');
INSERT INTO budget VALUES ('000000001', '000000002', 'FOOD', 60, 'Penang Street Food');
INSERT INTO budget VALUES ('000000001', '000000003', 'ATTRACTION', 20, 'Trick Eye Museum');
INSERT INTO budget VALUES ('000000001', '000000004', 'OTHERS', 2000, 'Hard Rock Hotel');
INSERT INTO budget VALUES ('000000001', '000000005', 'FOOD', 500, 'Din Tai Fung');
INSERT INTO budget VALUES ('000000002', '000000001', 'ATTRACTION', 8000, 'Universal Studios Malaysia');
INSERT INTO budget VALUES ('000000002', '000000002', 'OTHERS', 5000, 'Shopping Expenses');
INSERT INTO budget VALUES ('000000002', '000000003', 'FOOD', 2000, 'Ramen Restaurant');
INSERT INTO budget VALUES ('000000002', '000000004', 'FOOD', 100, 'Japanese Omurice');
INSERT INTO budget VALUES ('000000002', '000000005', 'TRANSPORT', 15, 'MRT fares');
INSERT INTO budget VALUES ('000000002', '000000006', 'OTHERS', 40, 'Jakuzi');
INSERT INTO budget VALUES ('000000002', '000000007', 'FOOD', 1000, 'Premium Japanese Food');
INSERT INTO budget VALUES ('000000003', '000000001', 'TRANSPORT', 200, 'Concession Card Fees');
INSERT INTO budget VALUES ('000000003', '000000002', 'OTHERS', 500, 'Souvenirs');
INSERT INTO budget VALUES ('000000003', '000000003', 'FOOD', 50, 'Kebab and Burritos');
INSERT INTO budget VALUES ('000000003', '000000004', 'FOOD', 100, 'Sausages and Ham');
INSERT INTO budget VALUES ('000000004', '000000001', 'FOOD', 1000, 'Western Restaurant Buffet');
INSERT INTO budget VALUES ('000000004', '000000002', 'ATTRACTION', 10, 'Entrance Fee to National Park');
INSERT INTO budget VALUES ('000000004', '000000003', 'TRANSPORT', 500, 'Public Transport Fees');
INSERT INTO budget VALUES ('000000004', '000000004', 'ATTRACTION', 100, 'Souvenirs from Night Market');
INSERT INTO budget VALUES ('000000004', '000000005', 'FOOD', 500, 'Burgers and Fries');
INSERT INTO budget VALUES ('000000004', '000000006', 'FOOD', 100, 'Chinese Restaurant');
INSERT INTO budget VALUES ('000000004', '000000007', 'OTHERS', 1000, 'Shopping Mall Groceries');
INSERT INTO budget VALUES ('000000004', '000000008', 'ATTRACTION', 600, 'Night Gazing Workshop');
INSERT INTO budget VALUES ('000000005', '000000001', 'FOOD', 300, 'Macdonalds');
INSERT INTO budget VALUES ('000000005', '000000002', 'ATTRACTION', 400, 'CERN tour tickets');
INSERT INTO budget VALUES ('000000005', '000000003', 'TRANSPORT', 1000, 'Public Transport Fees');
INSERT INTO budget VALUES ('000000005', '000000004', 'OTHERS', 2000, 'Hotel Fees');
INSERT INTO budget VALUES ('000000005', '000000005', 'OTHERS', 1000, 'Shopping Expenses');
INSERT INTO budget VALUES ('000000005', '000000006', 'FOOD', 400, 'Swiss Restaurant Desert');
INSERT INTO budget VALUES ('000000005', '000000007', 'ATTRACTION', 1240, 'Matterhorn Guided Tour');
INSERT INTO budget VALUES ('000000005', '000000008', 'TRANSPORT', 1044, 'Rail Tour');
INSERT INTO budget VALUES ('000000005', '000000009', 'OTHERS', 1000, 'Hiking Equipment');
INSERT INTO budget VALUES ('000000005', '000000010', 'OTHERS', 300, 'Tour Guide for Old Town');
INSERT INTO budget VALUES ('000000006', '000000001', 'ATTRACTION', 600, 'Honey Farm');
INSERT INTO budget VALUES ('000000006', '000000002', 'ATTRACTION', 500, 'Strawberry Farm');
INSERT INTO budget VALUES ('000000006', '000000003', 'ATTRACTION', 800, 'Penguin Siting Tour');
INSERT INTO budget VALUES ('000000006', '000000004', 'OTHERS', 1000, 'Hiking Gear');
INSERT INTO budget VALUES ('000000006', '000000005', 'ATTRACTION', 800, 'Mountain Hiking Tour');
INSERT INTO budget VALUES ('000000006', '000000006', 'ATTRACTION',400, 'Wildlife Reserve Tickets');
INSERT INTO budget VALUES ('000000006', '000000007', 'OTHERS', 1000, 'Apartment Rental');
INSERT INTO budget VALUES ('000000006', '000000008', 'FOOD', 400, 'Ship Restaurant');
INSERT INTO budget VALUES ('000000007', '000000001', 'OTHERS', 2500, 'Shopping Expenses');
INSERT INTO budget VALUES ('000000007', '000000002', 'FOOD', 100, 'Roadside Dumpling Restaurant');
INSERT INTO budget VALUES ('000000007', '000000003', 'FOOD', 800, 'Night Market Food');
INSERT INTO budget VALUES ('000000007', '000000004', 'FOOD', 500, 'Bangkok Weekend Market Food');
INSERT INTO budget VALUES ('000000007', '000000005', 'ATTRACTION', 200, 'Bangkok Cultural Tour');
INSERT INTO budget VALUES ('000000007', '000000006', 'FOOD', 100, 'Bangkok Flea Market Purchases');
INSERT INTO budget VALUES ('000000007', '000000007', 'ATTRACTION', 150, 'Longtail boat Canal Tour');
INSERT INTO budget VALUES ('000000007', '000000008', 'FOOD', 500, 'Railway market Food');
INSERT INTO budget VALUES ('000000008', '000000001', 'ATTRACTION', 100, 'Historical Museum Entrance Fees');
INSERT INTO budget VALUES ('000000008', '000000002', 'OTHERS', 500, 'Zhangjiajie National Park');
INSERT INTO budget VALUES ('000000009', '000000001', 'ATTRACTION', 150, 'Immersive Cultural Experience Tour');
INSERT INTO budget VALUES ('000000009', '000000002', 'FOOD', 200, 'Traditional Mongolia Food');
INSERT INTO budget VALUES ('000000010', '000000001', 'FOOD', 150, 'Roadside British Restaurant');
INSERT INTO budget VALUES ('000000010', '000000002', 'OTHERS', 500, 'Shopping Expenses');
INSERT INTO budget VALUES ('000000010', '000000003', 'ATTRACTION', 200, 'Monument Tour');
INSERT INTO budget VALUES ('000000010', '000000004', 'ATTRACTION', 150, 'Palace Visit');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
INSERT INTO album VALUES ('000000001', 'Memories of Japan Part 1', '2023-04-10', '000000002');
INSERT INTO album VALUES ('000000002', 'Memories of Japan Part 2', '2023-04-15', '000000002');
INSERT INTO album VALUES ('000000003', 'Memories of Germany', '2023-02-25', '000000003');
INSERT INTO album VALUES ('000000004', 'Memories of USA', '2023-06-20', '000000004');
INSERT INTO album VALUES ('000000005', 'Memories of Switzerland Part 1', '2024-06-10', '000000005');
INSERT INTO album VALUES ('000000006', 'Memories of Switzerland Part 2', '2024-06-15', '000000005');
INSERT INTO album VALUES ('000000007', 'Memories of Switzerland Part 3', '2024-06-23', '000000005');
INSERT INTO album VALUES ('000000008', 'Memories of Switzerland Part 4', '2024-06-25', '000000005');
INSERT INTO album VALUES ('000000009', 'Australia Mountains', '2023-05-10', '000000006');
INSERT INTO album VALUES ('000000010', 'Australia Farm Visits', '2023-05-12', '000000006');
INSERT INTO album VALUES ('000000011', 'Australia Family Photos', '2023-05-14', '000000006');
INSERT INTO album VALUES ('000000012', 'Australia Scenery', '2023-05-16', '000000006');
INSERT INTO album VALUES ('000000013', 'Australia Animals', '2023-05-18', '000000006');
INSERT INTO album VALUES ('000000014', 'Bangkok Street Food', '2023-04-21', '000000007');
INSERT INTO album VALUES ('000000015', 'Bangkok Night Markets', '2023-04-21', '000000007');
INSERT INTO album VALUES ('000000016', 'China nature sites', '2023-08-15', '000000008');
INSERT INTO album VALUES ('000000017', 'Memories of China trip', '2023-08-15', '000000008');
INSERT INTO album VALUES ('000000018', 'Mongolia Immersive Tour ', '2023-04-19', '000000009');
INSERT INTO album VALUES ('000000019', 'Memories of Mongolia Part 1', '2023-04-20', '000000009');
INSERT INTO album VALUES ('000000020', 'Memories of Mongolia Part 2', '2023-05-05', '000000009');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql

INSERT INTO photo VALUES ('000000001', 'picture1.jpg', '000000002');
INSERT INTO photo VALUES ('000000002', 'picture2.jpg', null);
INSERT INTO photo VALUES ('000000003', 'picture3.jpg', null);
INSERT INTO photo VALUES ('000000004', 'picture4.jpg', null);
INSERT INTO photo VALUES ('000000005', 'picture5.jpg', null);
INSERT INTO photo VALUES ('000000006', 'picture6.jpg', null);
INSERT INTO photo VALUES ('000000007', 'picture7.jpg', null);
INSERT INTO photo VALUES ('000000008', 'picture8.jpg', '000000007');
INSERT INTO photo VALUES ('000000009', 'picture9.jpg', '000000003');
INSERT INTO photo VALUES ('000000010', 'picture10.jpg', '000000003');
INSERT INTO photo VALUES ('000000011', 'picture11.jpg', '000000003');
INSERT INTO photo VALUES ('000000012', 'picture12.jpg', '000000003');
INSERT INTO photo VALUES ('000000013', 'picture13.jpg', '000000003');
INSERT INTO photo VALUES ('000000014', 'picture14.jpg', '000000003');
INSERT INTO photo VALUES ('000000015', 'picture15.jpg', '000000003');
INSERT INTO photo VALUES ('000000016', 'picture16.jpg', '000000001');
INSERT INTO photo VALUES ('000000017', 'picture17.jpg', '000000001');
INSERT INTO photo VALUES ('000000018', 'picture18.jpg', '000000002');
INSERT INTO photo VALUES ('000000019', 'picture19.jpg', '000000002');
INSERT INTO photo VALUES ('000000020', 'picture20.jpg', '000000002');
INSERT INTO photo VALUES ('000000021', 'picture21.jpg', '000000016');
INSERT INTO photo VALUES ('000000022', 'picture22.jpg', '000000016');
INSERT INTO photo VALUES ('000000023', 'picture23.jpg', '000000016');
INSERT INTO photo VALUES ('000000024', 'picture24.jpg', '000000004');
INSERT INTO photo VALUES ('000000025', 'picture25.jpg', '000000004');
INSERT INTO photo VALUES ('000000026', 'picture26.jpg', '000000004');
INSERT INTO photo VALUES ('000000027', 'picture27.jpg', '000000004');
INSERT INTO photo VALUES ('000000028', 'picture28.jpg', '000000004');
INSERT INTO photo VALUES ('000000029', 'picture29.jpg', '000000004');
INSERT INTO photo VALUES ('000000030', 'picture30.jpg', '000000004');
INSERT INTO photo VALUES ('000000031', 'picture31.jpg', '000000004');
INSERT INTO photo VALUES ('000000032', 'picture32.jpg', '000000004');
INSERT INTO photo VALUES ('000000033', 'picture33.jpg', '000000005');
INSERT INTO photo VALUES ('000000034', 'picture34.jpg', '000000006');
INSERT INTO photo VALUES ('000000035', 'picture35.jpg', '000000007');
INSERT INTO photo VALUES ('000000036', 'picture36.jpg', '000000008');
INSERT INTO photo VALUES ('000000037', 'picture37.jpg', '000000005');
INSERT INTO photo VALUES ('000000038', 'picture38.jpg', '000000006');
INSERT INTO photo VALUES ('000000039', 'picture39.jpg', '000000007');
INSERT INTO photo VALUES ('000000040', 'picture40.jpg', '000000008');
INSERT INTO photo VALUES ('000000041', 'picture41.jpg', '000000005');
INSERT INTO photo VALUES ('000000042', 'picture42.jpg', '000000006');
INSERT INTO photo VALUES ('000000043', 'picture43.jpg', '000000007');
INSERT INTO photo VALUES ('000000044', 'picture44.jpg', '000000008');
INSERT INTO photo VALUES ('000000045', 'picture45.jpg', '000000005');
INSERT INTO photo VALUES ('000000046', 'picture46.jpg', '000000006');
INSERT INTO photo VALUES ('000000047', 'picture47.jpg', '000000007');
INSERT INTO photo VALUES ('000000048', 'picture48.jpg', '000000008');
INSERT INTO photo VALUES ('000000049', 'picture49.jpg', '000000005');
INSERT INTO photo VALUES ('000000050', 'picture50.jpg', '000000006');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
INSERT INTO booking VALUES ('000000001', '20957134LAS', 'TRANSPORT', 'air ticket to malaysia', '20957134LAS.pdf');
INSERT INTO booking VALUES ('000000001', '57186275DGA', 'FOOD', 'reservation for restaurant', '57186275DGA.pdf');
INSERT INTO booking VALUES ('000000001', '56246593GLK', 'INSURANCE', 'basic insurance', '56246593GLK.pdf');
INSERT INTO booking VALUES ('000000002', '05782485KXN', 'ATTRACTION', 'premium tickets to museum', '05782485KXN.pdf');
INSERT INTO booking VALUES ('000000005', '09562434MAS', 'TRANSPORT', 'air ticket to switzerland', '09562434MAS.pdf');
INSERT INTO booking VALUES ('000000006', '23409845KFS', 'TRANSPORT', 'air ticket to australia', '23409845KFS.pdf');
INSERT INTO booking VALUES ('000000002', '34134123FDA', 'INSURANCE', 'Earthquake insurance', '34134123FDA.pdf');
INSERT INTO booking VALUES ('000000002', '2458745JKSF', 'FOOD', 'Reservation for ramen restaurant', '2458745JKSF.pdf');
INSERT INTO booking VALUES ('000000002', '989042JGKFS', 'TRANSPORT', 'Rental Mini Van', '989042JGKFS.pdf');
INSERT INTO booking VALUES ('000000003', '302870396HDLS', 'INSURANCE', 'premium insurance', '302870396HDLS.pdf');
INSERT INTO booking VALUES ('000000003', '49482JSDKF', 'FOOD', 'booking for kebab restaurant', '49482JSDKF.pdf');
INSERT INTO booking VALUES ('000000003', 'BFSD2462JS', 'ATTRACTION', 'germany city tour', 'BFSD2462JS.pdf');
INSERT INTO booking VALUES ('000000003', 'GSD39682JDF', 'TRANSPORT', 'germany air tickets', 'GSD39682JDF.pdf');
INSERT INTO booking VALUES ('000000003', '5923NFSDF432', 'TRANSPORT', 'bus transit tickets', '5923NFSDF432.pdf');
INSERT INTO booking VALUES ('000000003', 'FKJL93248025H', 'ATTRACTION', 'cave mine tour booking', 'FKJL93248025H.pdf');
INSERT INTO booking VALUES ('000000003', 'FGSF975238SDF', 'ATTRACTION', 'scenery walk booking', 'FGSF975238SDF.pdf');
INSERT INTO booking VALUES ('000000004', '35CXV8090ZC', 'OTHERS', 'hotel booking usa', '35CXV8090ZC.pdf');
INSERT INTO booking VALUES ('000000004', '523VBSFA352', 'INSURANCE', 'health insurance', '523VBSFA352.pdf');
INSERT INTO booking VALUES ('000000004', 'SFDFD35286DF', 'TRANSPORT', 'plane tickets', 'SFDFD35286DF.pdf');
INSERT INTO booking VALUES ('000000004', '70938GDKJS0SD', 'ATTRACTION', 'tickets to unesco sites', '70938GDKJS0SD.pdf');
INSERT INTO booking VALUES ('000000004', '45236HSDF8343', 'TRANSPORT', 'transit bus booking', '45236HSDF8343.pdf');
INSERT INTO booking VALUES ('000000004', '09568SDFKS3NX', 'ATTRACTION', 'city cultural tour', '09568SDFKS3NX.pdf');
INSERT INTO booking VALUES ('000000005', 'BM25385NCMXS', 'ATTRACTION', 'mountain tour switzerland', 'BM25385NCMXS.pdf');
INSERT INTO booking VALUES ('000000005', 'AD0235682NMS', 'TRANSPORT', 'hotel tickets', 'AD0235682NMS.pdf');
INSERT INTO booking VALUES ('000000005', '6341489SFSDFD', 'ATTRACTION', 'cultural tour ', '6341489SFSDFD.pdf');
INSERT INTO booking VALUES ('000000005', '43298SDFFNM3', 'INSURANCE', 'basic insurance plan', '43298SDFFNM3.pdf');
INSERT INTO booking VALUES ('000000005', '0S98DFSN2356N', 'FOOD', 'swiss restaurant booking', '0S98DFSN2356N.pdf');
INSERT INTO booking VALUES ('000000005', '230984NDSFJKD', 'TRANSPORT', 'tourist train ticket bookings', '230984NDSFJKD.pdf');
INSERT INTO booking VALUES ('000000005', '32598VFDJSKJS', 'ATTRACTION', 'swiss unesco site visit', '32598VFDJSKJS.pdf');
INSERT INTO booking VALUES ('000000005', '5398243DSFJFL', 'TRANSPORT', 'bus booking', '5398243DSFJFL.pdf');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
INSERT INTO itinerary VALUES ('000000001', 1, '09:00:00', 'ATTRACTION', 'penang street tour', 'penang street');
INSERT INTO itinerary VALUES ('000000001', 1, '12:00:00', 'FOOD', 'penang street food', 'penang street');
INSERT INTO itinerary VALUES ('000000001', 1, '14:00:00', 'SIGHTSEEING', 'penang street', 'penang street');
INSERT INTO itinerary VALUES ('000000001', 2, '08:00:00', 'TOUR', 'malaysia heritage tour', 'butterworth');
INSERT INTO itinerary VALUES ('000000001', 2, '13:00:00', 'FOOD', 'restaurant food', 'butterworth street 2');
INSERT INTO itinerary VALUES ('000000001', 2, '16:00:00', 'OTHERS', 'rest in hotel', 'butterworth');
INSERT INTO itinerary VALUES ('000000001', 3, '09:00:00', 'ATTRACTION', 'trickeye museum malaysia', 'kedah avenue 2');
INSERT INTO itinerary VALUES ('000000001', 3, '14:00:00', 'SIGHTSEEING', 'statues around city area', 'malaysia');
INSERT INTO itinerary VALUES ('000000001', 4, '09:00:00', 'SIGHTSEEING', 'stroll along mural walls', 'kuala lumpur street 14');
INSERT INTO itinerary VALUES ('000000002', 1, '09:00:00', 'ATTRACTION', 'sakura national park ', 'street 5');
INSERT INTO itinerary VALUES ('000000002', 1, '13:00:00', 'FOOD', 'Ramen restaurant', 'street 10');
INSERT INTO itinerary VALUES ('000000002', 1, '17:00:00', 'SIGHTSEEING', 'night streets shopping', 'tokyo streets');
INSERT INTO itinerary VALUES ('000000002', 2, '10:00:00', 'ATTRACTION', 'japanses tea cultural experience', 'street 15');
INSERT INTO itinerary VALUES ('000000002', 2, '15:00:00', 'FOOD', 'japanese snacks bar', 'street 20');
INSERT INTO itinerary VALUES ('000000002', 3, '09:00:00', 'SIGHTSEEING', 'japanses home visits', 'kyoto district 2');
INSERT INTO itinerary VALUES ('000000002', 3, '15:00:00', 'OTHERS', 'japanese souvenir shopping', 'kyoto district 5');
INSERT INTO itinerary VALUES ('000000002', 4, '08:00:00', 'FOOD', 'traditional japanese cuisine restaurant', 'osaka avenue 5');
INSERT INTO itinerary VALUES ('000000003', 1, '09:00:00', 'SIGHTSEEING', 'streets of gottingen', 'gottingen');
INSERT INTO itinerary VALUES ('000000003', 1, '11:00:00', 'OTHERS', 'Shopping', 'gottingen suburb town');
INSERT INTO itinerary VALUES ('000000003', 2, '12:00:00', 'TOUR', 'cave mine tour ', 'district 10');
INSERT INTO itinerary VALUES ('000000003', 2, '16:30:00', 'FOOD', 'Christmas market food', 'district 15');
INSERT INTO itinerary VALUES ('000000003', 3, '10:30:00', 'TOUR', 'Day tour of gottingen', 'gottingen area');
INSERT INTO itinerary VALUES ('000000003', 3, '16:30:00', 'SIGHTSEEING', 'ancient buildings of gottingen', 'gottingen area');
INSERT INTO itinerary VALUES ('000000004', 1, '08:00:00', 'OTHERS', 'USA Immersion Trip Day 1 Camp', 'california');
INSERT INTO itinerary VALUES ('000000004', 2, '09:00:00', 'OTHERS', 'USA Immersion Trip Day 2 Camp', 'texas street 10');
INSERT INTO itinerary VALUES ('000000004', 3, '08:30:00', 'OTHERS', 'USA Immersion Trip Day 3 Camp', 'michigan area 2');
INSERT INTO itinerary VALUES ('000000004', 4, '09:00:00', 'OTHERS', 'USA Immersion Trip Day 4 Camp', 'florida');
INSERT INTO itinerary VALUES ('000000005', 1, '10:00:00', 'OTHERS', 'CERN Welcome Lecture', 'avenue 100');
INSERT INTO itinerary VALUES ('000000005', 1, '18:00:00', 'ATTRACTION', 'Visit to Museum', 'avenue 251');
INSERT INTO itinerary VALUES ('000000005', 2, '09:30:00', 'OTHERS', 'CERN Workshop', 'avenue 100');
INSERT INTO itinerary VALUES ('000000005', 3, '09:00:00', 'TOUR', 'CERN Site Day Tour', 'avenue 100');
INSERT INTO itinerary VALUES ('000000005', 4, '08:30:00', 'OTHERS', 'CERN Content Lecture', 'avenue 100');
INSERT INTO itinerary VALUES ('000000005', 5, '08:45:00', 'OTHERS', 'Visit to Data Center CERN', 'avenue 105');
INSERT INTO itinerary VALUES ('000000005', 5, '20:00:00', 'SIGHTSEEING', 'Switzerland Night Market', 'switz zurich street 10');
INSERT INTO itinerary VALUES ('000000005', 6, '08:30:00', 'TOUR', 'Accelerator Tour', 'avenue 110');
INSERT INTO itinerary VALUES ('000000005', 6, '17:30:00', 'FOOD', 'Swiss Restaurant for Dinner', 'switz street 341');
INSERT INTO itinerary VALUES ('000000005', 7, '08:00:00', 'OTHERS', 'Day Immersion in Switzerland Culture', 'switz district 10');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql
INSERT INTO destination VALUES ('000000001', 'Malaysia', 'Penang');
INSERT INTO destination VALUES ('000000002', 'Malaysia', 'Butterworth');
INSERT INTO destination VALUES ('000000003', 'Malaysia', 'Kedah');
INSERT INTO destination VALUES ('000000004', 'Malaysia', 'Kualar Lumpur');
INSERT INTO destination VALUES ('000000005', 'Japan', 'Tokyo');
INSERT INTO destination VALUES ('000000006', 'Japan', 'Hokkaido');
INSERT INTO destination VALUES ('000000007', 'Japan', 'Kyoto');
INSERT INTO destination VALUES ('000000008', 'Japan', 'Osaka');
INSERT INTO destination VALUES ('000000009', 'Germany', 'Gottingen');
INSERT INTO destination VALUES ('000000010', 'Germany', 'Berlin');
INSERT INTO destination VALUES ('000000011', 'USA', 'California');
INSERT INTO destination VALUES ('000000012', 'USA', 'Texas');
INSERT INTO destination VALUES ('000000013', 'USA', 'Michigan');
INSERT INTO destination VALUES ('000000014', 'USA', 'Florida');
INSERT INTO destination VALUES ('000000015', 'Switzerland', 'Bern');
INSERT INTO destination VALUES ('000000016', 'Switzerland', 'Zurich');
INSERT INTO destination VALUES ('000000017', 'Switzerland', 'Lucerne');
INSERT INTO destination VALUES ('000000018', 'Switzerland', 'Lausanne');
INSERT INTO destination VALUES ('000000019', 'Switzerland', 'Grindelwald');
INSERT INTO destination VALUES ('000000020', 'Switzerland', 'Basel');
INSERT INTO destination VALUES ('000000021', 'Thailand', 'Bangkok');
INSERT INTO destination VALUES ('000000022', 'France', 'Paris');
INSERT INTO destination VALUES ('000000023', 'China', 'Shanghai');
INSERT INTO destination VALUES ('000000024', 'China', 'Xiamen');
INSERT INTO destination VALUES ('000000025', 'Australia', 'Tasmania');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql
INSERT INTO has_destination VALUES ('000000001', '000000001', 1, '2023-02-13 ');
INSERT INTO has_destination VALUES ('000000001', '000000002', 1, '2023-02-14 ');
INSERT INTO has_destination VALUES ('000000001', '000000003', 1, '2023-02-14 ');
INSERT INTO has_destination VALUES ('000000001', '000000004', 1, '2023-02-15 ');
INSERT INTO has_destination VALUES ('000000002', '000000005', 2, '2023-03-31 ');
INSERT INTO has_destination VALUES ('000000002', '000000006', 2, '2023-04-02 ');
INSERT INTO has_destination VALUES ('000000002', '000000007', 2, '2023-04-05 ');
INSERT INTO has_destination VALUES ('000000002', '000000008', 3, '2023-04-07 ');
INSERT INTO has_destination VALUES ('000000003', '000000009', 8, '2023-02-27 ');
INSERT INTO has_destination VALUES ('000000003', '000000010', 3, '2023-03-07 ');
INSERT INTO has_destination VALUES ('000000004', '000000011', 1, '2023-06-13 ');
INSERT INTO has_destination VALUES ('000000004', '000000012', 2, '2023-06-14 ');
INSERT INTO has_destination VALUES ('000000004', '000000013', 2, '2023-06-16 ');
INSERT INTO has_destination VALUES ('000000004', '000000014', 2, '2023-06-18 ');
INSERT INTO has_destination VALUES ('000000005', '000000015', 4, '2024-06-02 ');
INSERT INTO has_destination VALUES ('000000005', '000000016', 3, '2024-06-06 ');
INSERT INTO has_destination VALUES ('000000005', '000000017', 3, '2024-06-09 ');
INSERT INTO has_destination VALUES ('000000005', '000000018', 3, '2024-06-12 ');
INSERT INTO has_destination VALUES ('000000005', '000000019', 2, '2024-06-15 ');
INSERT INTO has_destination VALUES ('000000005', '000000020', 3, '2024-06-17 ');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
INSERT INTO vac_map VALUES ('000000001', 'map-penang.pdf', 'Map of Penang', 'GENERAL');
INSERT INTO vac_map VALUES ('000000002', 'map-japan-mrt.pdf', 'Map of Japan MRT Lines', 'TRANSPORT');
INSERT INTO vac_map VALUES ('000000003', 'map-gemany-rewe.pdf', 'Map of Germany Shopping Mall Rewe', 'OTHERS');
INSERT INTO vac_map VALUES ('000000004', 'map-usa-california.pdf', 'Map of USA State California', 'GENERAL');
INSERT INTO vac_map VALUES ('000000005', 'map-switz-museum.pdf', 'Map of Switzerland Museum', 'ATTRACTION');
INSERT INTO vac_map VALUES ('000000006', 'map-aus-tasmania.pdf', 'Terrain Guide of Australia Tasmania', 'OTHERS');
INSERT INTO vac_map VALUES ('000000007', 'map-christmas-market.pdf', 'Christmas Market Highlights', 'OTHERS');
INSERT INTO vac_map VALUES ('000000008', 'map-penang-recommend.pdf', 'Penang Street Recommended Locations', 'ATTRACTION');
INSERT INTO vac_map VALUES ('000000009', 'map-cern.pdf', 'CERN Building', 'OTHERS');
INSERT INTO vac_map VALUES ('000000010', 'map-german-bus.pdf', 'Germany Bus Timings', 'TRANSPORT');
INSERT INTO vac_map VALUES ('000000011', 'map-japan-streets.pdf', 'Japanses Street Eateries', 'OTHERS');
INSERT INTO vac_map VALUES ('000000012', 'map-cave-mine.pdf', 'Germany UNESCO Mine Site', 'ATTRACTION');
INSERT INTO vac_map VALUES ('000000013', 'map-usa-camp-tour-route.pdf', 'May of USA Camp Tour Route', 'GENERAL');
INSERT INTO vac_map VALUES ('000000014', 'map-switz-cultural-sites.pdf', 'Iconic Sites in Switzerland', 'GENERAL');
INSERT INTO vac_map VALUES ('000000015', 'map-germany.pdf', 'Map of Germany', 'GENERAL');
INSERT INTO vac_map VALUES ('000000016', 'map-usa-mrt.pdf', 'Subway Railway Lines USA', 'TRANSPORT');
INSERT INTO vac_map VALUES ('000000017', 'map-switzerland.pdf', 'Map of Switzerland', 'GENERAL');
INSERT INTO vac_map VALUES ('000000018', 'map-swiss-night-attractions.pdf', 'Night Attractions of Switzerland', 'ATTRACTION');
INSERT INTO vac_map VALUES ('000000019', 'map-swiss-bus-timings.pdf', 'Bus availability Switzerland', 'TRANSPORT');
INSERT INTO vac_map VALUES ('000000020', 'map-accelerator-layout-cern.pdf', 'Accelerator Layout for CERN', 'OTHERS');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [18]:
%%sql
INSERT INTO ref_map_itin VALUES ('000000001', '09:00:00', 1, '000000001');
INSERT INTO ref_map_itin VALUES ('000000003', '11:00:00', 1, '000000003');
INSERT INTO ref_map_itin VALUES ('000000003', '09:00:00', 1, '000000007');
INSERT INTO ref_map_itin VALUES ('000000001', '12:00:00', 1, '000000008');
INSERT INTO ref_map_itin VALUES ('000000005', '08:45:00', 5, '000000009');
INSERT INTO ref_map_itin VALUES ('000000003', '09:00:00', 1, '000000010');
INSERT INTO ref_map_itin VALUES ('000000003', '11:00:00', 1, '000000010');
INSERT INTO ref_map_itin VALUES ('000000001', '14:00:00', 1, '000000008');
INSERT INTO ref_map_itin VALUES ('000000005', '09:00:00', 3, '000000009');
INSERT INTO ref_map_itin VALUES ('000000004', '08:00:00', 1, '000000013');
INSERT INTO ref_map_itin VALUES ('000000004', '09:00:00', 2, '000000013');
INSERT INTO ref_map_itin VALUES ('000000004', '08:30:00', 3, '000000013');
INSERT INTO ref_map_itin VALUES ('000000004', '09:00:00', 4, '000000013');
INSERT INTO ref_map_itin VALUES ('000000005', '18:00:00', 1, '000000005');
INSERT INTO ref_map_itin VALUES ('000000002', '17:00:00', 1, '000000011');
INSERT INTO ref_map_itin VALUES ('000000003', '12:00:00', 2, '000000012');
INSERT INTO ref_map_itin VALUES ('000000005', '08:00:00', 7, '000000014');
INSERT INTO ref_map_itin VALUES ('000000005', '08:30:00', 6, '000000020');
INSERT INTO ref_map_itin VALUES ('000000005', '20:00:00', 5, '000000019');
INSERT INTO ref_map_itin VALUES ('000000005', '20:00:00', 5, '000000018');
INSERT INTO ref_map_itin VALUES ('000000003', '10:30:00', 3, '000000010');

 * mysql+pymysql://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql

Create view vacation_summary as

(select expenditure_summary_tbl.vac_id, start_date, end_date, first_state, first_country, last_state, last_country, 
datediff(end_date,start_date) as days, budget_limit, total_spend, remaining_budget from 

(select start_destination_tbl.vac_id, first_state, first_country, last_state, last_country from
(select vac_id,state as first_state,country as first_country from destination d1, has_destination hd1
where dstart_date <= all (select dstart_date from has_destination hd2, destination d2
where hd2.vac_id = hd1.vac_id and hd2.dest_id = d2.dest_id) and hd1.dest_id = d1.dest_id) as start_destination_tbl

join 

(select vac_id,state as last_state,country as last_country from destination d3, has_destination hd3
where dstart_date >= all (select dstart_date from has_destination hd4, destination d4 
where hd4.vac_id = hd3.vac_id and hd4.dest_id = d4.dest_id) and d3.dest_id = hd3.dest_id) as end_destination_tbl

on start_destination_tbl.vac_id = end_destination_tbl.vac_id) as destination_summary_tbl

right join  

(select start_end_vac.vac_id, start_date, end_date, days, budget_limit, total_spend, remaining_budget from
(select vac_id, start_date, end_date, datediff(end_date,start_date) as days from vacation) as start_end_vac

join

(select vac_id, budget_limit, 
case
    when total_spend is null then 0
    else total_spend
end as total_spend,

case
    when remaining_budget is null then budget_limit
    else remaining_budget
end as remaining_budget

from 
    
(select vacation_tbl.vac_id, budget_limit, total_spend, budget_limit-total_spend as remaining_budget 

from 
(select vacation.vac_id, budget_limit from vacation) as vacation_tbl

left join

(select budget.vac_id, sum(expenditure) as total_spend from budget group by budget.vac_id) as budget_tbl

on vacation_tbl.vac_id = budget_tbl.vac_id) as before_process_budget) as expense_tbl

on start_end_vac.vac_id = expense_tbl.vac_id) as expenditure_summary_tbl

on expenditure_summary_tbl.vac_id = destination_summary_tbl.vac_id)

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [21]:
%%sql
Create view vac_user_has as
select user.user_id,vacation.vac_id from user,vacation,vac_user_in
where user.user_id = vac_user_in.user_id and vac_user_in.vac_grp_id = vacation.vac_grp_id;
select * from vac_user_has

 * mysql+pymysql://root:***@localhost/
0 rows affected.
151 rows affected.

[('000000001', '000000002'),
 ('000000001', '000000001'),
 ('000000001', '000000009'),
 ('000000001', '000000013'),
 ('000000001', '000000015'),
 ('000000001', '000000006'),
 ('000000001', '000000019'),
 ('000000001', '000000004'),
 ('000000001', '000000005'),
 ('000000001', '000000011'),
 ('000000001', '000000017'),
 ('000000002', '000000002'),
 ('000000002', '000000003'),
 ('000000002', '000000018'),
 ('000000002', '000000001'),
 ('000000002', '000000009'),
 ('000000002', '000000013'),
 ('000000002', '000000015'),
 ('000000002', '000000006'),
 ('000000002', '000000019'),
 ('000000002', '000000004'),
 ('000000002', '000000005'),
 ('000000002', '000000011'),
 ('000000002', '000000010'),
 ('000000002', '000000016'),
 ('000000002', '000000017'),
 ('000000002', '000000008'),
 ('000000002', '000000014'),
 ('000000002', '000000020'),
 ('000000002', '000000007'),
 ('000000002', '000000012'),
 ('000000003', '000000002'),
 ('000000003', '000000006'),
 ('000000003', '000000019'),
 ('000000003', '000000004'),
 ('000000003', '000000005'),
 ('000000003', '000000011'),
 ('000000003', '000000010'),
 ('000000003', '000000016'),
 ('000000003', '000000008'),
 ('000000003', '000000014'),
 ('000000003', '000000020'),
 ('000000003', '000000012'),
 ('000000004', '000000002'),
 ('000000004', '000000003'),
 ('000000004', '000000018'),
 ('000000004', '000000001'),
 ('000000004', '000000009'),
 ('000000004', '000000013'),
 ('000000004', '000000015'),
 ('000000004', '000000004'),
 ('000000004', '000000005'),
 ('000000004', '000000011'),
 ('000000004', '000000010'),
 ('000000004', '000000016'),
 ('000000004', '000000007'),
 ('000000004', '000000012'),
 ('000000005', '000000002'),
 ('000000005', '000000003'),
 ('000000005', '000000018'),
 ('000000005', '000000004'),
 ('000000005', '000000005'),
 ('000000005', '000000011'),
 ('000000005', '000000017'),
 ('000000006', '000000002'),
 ('000000006', '000000003'),
 ('000000006', '000000018'),
 ('000000006', '000000006'),
 ('000000006', '000000019'),
 ('000000006', '000000017'),
 ('000000006', '000000007'),
 ('000000006', '000000012'),
 ('000000007', '000000001'),
 ('000000007', '000000009'),
 ('000000007', '000000013'),
 ('000000007', '000000015'),
 ('000000007', '000000010'),
 ('000000007', '000000016'),
 ('000000007', '000000017'),
 ('000000008', '000000002'),
 ('000000008', '000000017'),
 ('000000008', '000000008'),
 ('000000008', '000000014'),
 ('000000008', '000000020'),
 ('000000008', '000000012'),
 ('000000009', '000000003'),
 ('000000009', '000000018'),
 ('000000009', '000000006'),
 ('000000009', '000000019'),
 ('000000009', '000000004'),
 ('000000009', '000000005'),
 ('000000009', '000000011'),
 ('000000009', '000000008'),
 ('000000009', '000000014'),
 ('000000009', '000000020'),
 ('000000009', '000000007'),
 ('000000010', '000000003'),
 ('000000010', '000000018'),
 ('000000010', '000000001'),
 ('000000010', '000000009'),
 ('000000010', '000000013'),
 ('000000010', '000000015'),
 ('000000010', '000000008'),
 ('000000010', '000000014'),
 ('000000010', '000000020'),
 ('000000010', '000000007'),
 ('000000010', '000000012'),
 ('000000011', '000000006'),
 ('000000011', '000000019'),
 ('000000011', '000000017'),
 ('000000011', '000000008'),
 ('000000011', '000000014'),
 ('000000011', '000000020'),
 ('000000011', '000000007'),
 ('000000012', '000000002'),
 ('000000012', '000000001'),
 ('000000012', '000000009'),
 ('000000012', '000000013'),
 ('000000012', '000000015'),
 ('000000012', '000000006'),
 ('000000012', '000000019'),
 ('000000012', '000000008'),
 ('000000012', '000000014'),
 ('000000012', '000000020'),
 ('000000013', '000000004'),
 ('000000013', '000000005'),
 ('000000013', '000000011'),
 ('000000013', '000000012'),
 ('000000014', '000000003'),
 ('000000014', '000000018'),
 ('000000014', '000000001'),
 ('000000014', '000000009'),
 ('000000014', '000000013'),
 ('000000014', '000000015'),
 ('000000014', '000000006'),
 ('000000014', '000000019'),
 ('000000014', '000000004'),
 ('000000014', '000000005'),
 ('000000014', '000000011'),
 ('000000014', '000000010'),
 ('000000014', '000000016'),
 ('000000015', '000000001'),
 ('000000015', '000000009'),
 ('000000015', '000000013'),
 ('000000015', '000000015'),
 ('000000015', '000000010'),
 ('000000015', '000000016'),
 ('000000015', '000000008'),
 ('000000015', '000000014'),
 ('000000015', '000000020'),
 ('000000015', '000000012')]

In [22]:
%%sql
select * from vac_user_has

 * mysql+pymysql://root:***@localhost/
151 rows affected.

[('000000001', '000000002'),
 ('000000001', '000000001'),
 ('000000001', '000000009'),
 ('000000001', '000000013'),
 ('000000001', '000000015'),
 ('000000001', '000000006'),
 ('000000001', '000000019'),
 ('000000001', '000000004'),
 ('000000001', '000000005'),
 ('000000001', '000000011'),
 ('000000001', '000000017'),
 ('000000002', '000000002'),
 ('000000002', '000000003'),
 ('000000002', '000000018'),
 ('000000002', '000000001'),
 ('000000002', '000000009'),
 ('000000002', '000000013'),
 ('000000002', '000000015'),
 ('000000002', '000000006'),
 ('000000002', '000000019'),
 ('000000002', '000000004'),
 ('000000002', '000000005'),
 ('000000002', '000000011'),
 ('000000002', '000000010'),
 ('000000002', '000000016'),
 ('000000002', '000000017'),
 ('000000002', '000000008'),
 ('000000002', '000000014'),
 ('000000002', '000000020'),
 ('000000002', '000000007'),
 ('000000002', '000000012'),
 ('000000003', '000000002'),
 ('000000003', '000000006'),
 ('000000003', '000000019'),
 ('000000003', '000000004'),
 ('000000003', '000000005'),
 ('000000003', '000000011'),
 ('000000003', '000000010'),
 ('000000003', '000000016'),
 ('000000003', '000000008'),
 ('000000003', '000000014'),
 ('000000003', '000000020'),
 ('000000003', '000000012'),
 ('000000004', '000000002'),
 ('000000004', '000000003'),
 ('000000004', '000000018'),
 ('000000004', '000000001'),
 ('000000004', '000000009'),
 ('000000004', '000000013'),
 ('000000004', '000000015'),
 ('000000004', '000000004'),
 ('000000004', '000000005'),
 ('000000004', '000000011'),
 ('000000004', '000000010'),
 ('000000004', '000000016'),
 ('000000004', '000000007'),
 ('000000004', '000000012'),
 ('000000005', '000000002'),
 ('000000005', '000000003'),
 ('000000005', '000000018'),
 ('000000005', '000000004'),
 ('000000005', '000000005'),
 ('000000005', '000000011'),
 ('000000005', '000000017'),
 ('000000006', '000000002'),
 ('000000006', '000000003'),
 ('000000006', '000000018'),
 ('000000006', '000000006'),
 ('000000006', '000000019'),
 ('000000006', '000000017'),
 ('000000006', '000000007'),
 ('000000006', '000000012'),
 ('000000007', '000000001'),
 ('000000007', '000000009'),
 ('000000007', '000000013'),
 ('000000007', '000000015'),
 ('000000007', '000000010'),
 ('000000007', '000000016'),
 ('000000007', '000000017'),
 ('000000008', '000000002'),
 ('000000008', '000000017'),
 ('000000008', '000000008'),
 ('000000008', '000000014'),
 ('000000008', '000000020'),
 ('000000008', '000000012'),
 ('000000009', '000000003'),
 ('000000009', '000000018'),
 ('000000009', '000000006'),
 ('000000009', '000000019'),
 ('000000009', '000000004'),
 ('000000009', '000000005'),
 ('000000009', '000000011'),
 ('000000009', '000000008'),
 ('000000009', '000000014'),
 ('000000009', '000000020'),
 ('000000009', '000000007'),
 ('000000010', '000000003'),
 ('000000010', '000000018'),
 ('000000010', '000000001'),
 ('000000010', '000000009'),
 ('000000010', '000000013'),
 ('000000010', '000000015'),
 ('000000010', '000000008'),
 ('000000010', '000000014'),
 ('000000010', '000000020'),
 ('000000010', '000000007'),
 ('000000010', '000000012'),
 ('000000011', '000000006'),
 ('000000011', '000000019'),
 ('000000011', '000000017'),
 ('000000011', '000000008'),
 ('000000011', '000000014'),
 ('000000011', '000000020'),
 ('000000011', '000000007'),
 ('000000012', '000000002'),
 ('000000012', '000000001'),
 ('000000012', '000000009'),
 ('000000012', '000000013'),
 ('000000012', '000000015'),
 ('000000012', '000000006'),
 ('000000012', '000000019'),
 ('000000012', '000000008'),
 ('000000012', '000000014'),
 ('000000012', '000000020'),
 ('000000013', '000000004'),
 ('000000013', '000000005'),
 ('000000013', '000000011'),
 ('000000013', '000000012'),
 ('000000014', '000000003'),
 ('000000014', '000000018'),
 ('000000014', '000000001'),
 ('000000014', '000000009'),
 ('000000014', '000000013'),
 ('000000014', '000000015'),
 ('000000014', '000000006'),
 ('000000014', '000000019'),
 ('000000014', '000000004'),
 ('000000014', '000000005'),
 ('000000014', '000000011'),
 ('000000014', '000000010'),
 ('000000014', '000000016'),
 ('000000015', '000000001'),
 ('000000015', '000000009'),
 ('000000015', '000000013'),
 ('000000015', '000000015'),
 ('000000015', '000000010'),
 ('000000015', '000000016'),
 ('000000015', '000000008'),
 ('000000015', '000000014'),
 ('000000015', '000000020'),
 ('000000015', '000000012')]

In [23]:
%%sql
#album photos table

Create view user_photos as

(select vac_user_has.user_id, vac_user_has.vac_id, photo.photo_id from photo, album, vac_user_has
where album.vac_id = vac_user_has.vac_id and photo.alb_id = album.alb_id)

union

#public photos_table
(select null as user_id, null as vac_id, photo_id from photo where photo.alb_id is null)

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [25]:
%%sql    
select *, date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id

 * mysql+pymysql://root:***@localhost/
20 rows affected.

[('000000001', '000000001', 1, datetime.date(2023, 2, 13), '000000001', 'Malaysia', 'Penang', datetime.date(2023, 2, 13)),
 ('000000001', '000000002', 1, datetime.date(2023, 2, 14), '000000002', 'Malaysia', 'Butterworth', datetime.date(2023, 2, 14)),
 ('000000001', '000000003', 1, datetime.date(2023, 2, 14), '000000003', 'Malaysia', 'Kedah', datetime.date(2023, 2, 14)),
 ('000000001', '000000004', 1, datetime.date(2023, 2, 15), '000000004', 'Malaysia', 'Kualar Lumpur', datetime.date(2023, 2, 15)),
 ('000000002', '000000005', 2, datetime.date(2023, 3, 31), '000000005', 'Japan', 'Tokyo', datetime.date(2023, 4, 1)),
 ('000000002', '000000006', 2, datetime.date(2023, 4, 2), '000000006', 'Japan', 'Hokkaido', datetime.date(2023, 4, 3)),
 ('000000002', '000000007', 2, datetime.date(2023, 4, 5), '000000007', 'Japan', 'Kyoto', datetime.date(2023, 4, 6)),
 ('000000002', '000000008', 3, datetime.date(2023, 4, 7), '000000008', 'Japan', 'Osaka', datetime.date(2023, 4, 9)),
 ('000000003', '000000009', 8, datetime.date(2023, 2, 27), '000000009', 'Germany', 'Gottingen', datetime.date(2023, 3, 6)),
 ('000000003', '000000010', 3, datetime.date(2023, 3, 7), '000000010', 'Germany', 'Berlin', datetime.date(2023, 3, 9)),
 ('000000004', '000000011', 1, datetime.date(2023, 6, 13), '000000011', 'USA', 'California', datetime.date(2023, 6, 13)),
 ('000000004', '000000012', 2, datetime.date(2023, 6, 14), '000000012', 'USA', 'Texas', datetime.date(2023, 6, 15)),
 ('000000004', '000000013', 2, datetime.date(2023, 6, 16), '000000013', 'USA', 'Michigan', datetime.date(2023, 6, 17)),
 ('000000004', '000000014', 2, datetime.date(2023, 6, 18), '000000014', 'USA', 'Florida', datetime.date(2023, 6, 19)),
 ('000000005', '000000015', 4, datetime.date(2024, 6, 2), '000000015', 'Switzerland', 'Bern', datetime.date(2024, 6, 5)),
 ('000000005', '000000016', 3, datetime.date(2024, 6, 6), '000000016', 'Switzerland', 'Zurich', datetime.date(2024, 6, 8)),
 ('000000005', '000000017', 3, datetime.date(2024, 6, 9), '000000017', 'Switzerland', 'Lucerne', datetime.date(2024, 6, 11)),
 ('000000005', '000000018', 3, datetime.date(2024, 6, 12), '000000018', 'Switzerland', 'Lausanne', datetime.date(2024, 6, 14)),
 ('000000005', '000000019', 2, datetime.date(2024, 6, 15), '000000019', 'Switzerland', 'Grindelwald', datetime.date(2024, 6, 16)),
 ('000000005', '000000020', 3, datetime.date(2024, 6, 17), '000000020', 'Switzerland', 'Basel', datetime.date(2024, 6, 19))]

In [26]:
%%sql

Create view vacation_itinerary as

select sub_timeline_tbl.vac_id, itin_date, itin_time, itin_type, description, location, country, state, day_no from 
(select itinerary.vac_id, day_no, itin_time, itin_type, description, location,
date_add(start_date, interval (day_no-1) day) as itin_date from 

itinerary

join 

(select vac_id, start_date from vacation) as vacation_tbl

on itinerary.vac_id = vacation_tbl.vac_id) as sub_timeline_tbl

left join

(select vac_id, has_destination.dest_id, no_days, dstart_date, country, state, 
 date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id) as destination_tbl

on sub_timeline_tbl.vac_id = destination_tbl.vac_id and 
(sub_timeline_tbl.itin_date >= dstart_date and sub_timeline_tbl.itin_date <=dend_date)

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [28]:
%%sql
create view maps_itinerary_tbl as 
select maps_tbl.vac_id, maps_tbl.itin_time, maps_tbl.day_no, map_id, map_link, name, category ,
itin_date, itin_type, description, location, country, state from
(select vac_id, itin_time, day_no, vac_map.map_id, map_link, name, category from 

(ref_map_itin join vac_map on vac_map.map_id = ref_map_itin.map_id)) as maps_tbl

join 

vacation_itinerary

on (vacation_itinerary.day_no = maps_tbl.day_no) and (vacation_itinerary.itin_time = maps_tbl.itin_time) 
and (vacation_itinerary.vac_id = maps_tbl.vac_id)

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [29]:
%%sql
select * from maps_itinerary_tbl

 * mysql+pymysql://root:***@localhost/
21 rows affected.

[('000000001', datetime.timedelta(seconds=32400), 1, '000000001', 'map-penang.pdf', 'Map of Penang', 'GENERAL', datetime.date(2023, 2, 13), 'ATTRACTION', 'penang street tour', 'penang street', 'Malaysia', 'Penang'),
 ('000000003', datetime.timedelta(seconds=39600), 1, '000000003', 'map-gemany-rewe.pdf', 'Map of Germany Shopping Mall Rewe', 'OTHERS', datetime.date(2023, 2, 26), 'OTHERS', 'Shopping', 'gottingen suburb town', None, None),
 ('000000005', datetime.timedelta(seconds=64800), 1, '000000005', 'map-switz-museum.pdf', 'Map of Switzerland Museum', 'ATTRACTION', datetime.date(2024, 6, 2), 'ATTRACTION', 'Visit to Museum', 'avenue 251', 'Switzerland', 'Bern'),
 ('000000003', datetime.timedelta(seconds=32400), 1, '000000007', 'map-christmas-market.pdf', 'Christmas Market Highlights', 'OTHERS', datetime.date(2023, 2, 26), 'SIGHTSEEING', 'streets of gottingen', 'gottingen', None, None),
 ('000000001', datetime.timedelta(seconds=43200), 1, '000000008', 'map-penang-recommend.pdf', 'Penang Street Recommended Locations', 'ATTRACTION', datetime.date(2023, 2, 13), 'FOOD', 'penang street food', 'penang street', 'Malaysia', 'Penang'),
 ('000000001', datetime.timedelta(seconds=50400), 1, '000000008', 'map-penang-recommend.pdf', 'Penang Street Recommended Locations', 'ATTRACTION', datetime.date(2023, 2, 13), 'SIGHTSEEING', 'penang street', 'penang street', 'Malaysia', 'Penang'),
 ('000000005', datetime.timedelta(seconds=32400), 3, '000000009', 'map-cern.pdf', 'CERN Building', 'OTHERS', datetime.date(2024, 6, 4), 'TOUR', 'CERN Site Day Tour', 'avenue 100', 'Switzerland', 'Bern'),
 ('000000005', datetime.timedelta(seconds=31500), 5, '000000009', 'map-cern.pdf', 'CERN Building', 'OTHERS', datetime.date(2024, 6, 6), 'OTHERS', 'Visit to Data Center CERN', 'avenue 105', 'Switzerland', 'Zurich'),
 ('000000003', datetime.timedelta(seconds=32400), 1, '000000010', 'map-german-bus.pdf', 'Germany Bus Timings', 'TRANSPORT', datetime.date(2023, 2, 26), 'SIGHTSEEING', 'streets of gottingen', 'gottingen', None, None),
 ('000000003', datetime.timedelta(seconds=39600), 1, '000000010', 'map-german-bus.pdf', 'Germany Bus Timings', 'TRANSPORT', datetime.date(2023, 2, 26), 'OTHERS', 'Shopping', 'gottingen suburb town', None, None),
 ('000000003', datetime.timedelta(seconds=37800), 3, '000000010', 'map-german-bus.pdf', 'Germany Bus Timings', 'TRANSPORT', datetime.date(2023, 2, 28), 'TOUR', 'Day tour of gottingen', 'gottingen area', 'Germany', 'Gottingen'),
 ('000000002', datetime.timedelta(seconds=61200), 1, '000000011', 'map-japan-streets.pdf', 'Japanses Street Eateries', 'OTHERS', datetime.date(2023, 3, 29), 'SIGHTSEEING', 'night streets shopping', 'tokyo streets', None, None),
 ('000000003', datetime.timedelta(seconds=43200), 2, '000000012', 'map-cave-mine.pdf', 'Germany UNESCO Mine Site', 'ATTRACTION', datetime.date(2023, 2, 27), 'TOUR', 'cave mine tour ', 'district 10', 'Germany', 'Gottingen'),
 ('000000004', datetime.timedelta(seconds=28800), 1, '000000013', 'map-usa-camp-tour-route.pdf', 'May of USA Camp Tour Route', 'GENERAL', datetime.date(2023, 6, 13), 'OTHERS', 'USA Immersion Trip Day 1 Camp', 'california', 'USA', 'California'),
 ('000000004', datetime.timedelta(seconds=32400), 2, '000000013', 'map-usa-camp-tour-route.pdf', 'May of USA Camp Tour Route', 'GENERAL', datetime.date(2023, 6, 14), 'OTHERS', 'USA Immersion Trip Day 2 Camp', 'texas street 10', 'USA', 'Texas'),
 ('000000004', datetime.timedelta(seconds=30600), 3, '000000013', 'map-usa-camp-tour-route.pdf', 'May of USA Camp Tour Route', 'GENERAL', datetime.date(2023, 6, 15), 'OTHERS', 'USA Immersion Trip Day 3 Camp', 'michigan area 2', 'USA', 'Texas'),
 ('000000004', datetime.timedelta(seconds=32400), 4, '000000013', 'map-usa-camp-tour-route.pdf', 'May of USA Camp Tour Route', 'GENERAL', datetime.date(2023, 6, 16), 'OTHERS', 'USA Immersion Trip Day 4 Camp', 'florida', 'USA', 'Michigan'),
 ('000000005', datetime.timedelta(seconds=28800), 7, '000000014', 'map-switz-cultural-sites.pdf', 'Iconic Sites in Switzerland', 'GENERAL', datetime.date(2024, 6, 8), 'OTHERS', 'Day Immersion in Switzerland Culture', 'switz district 10', 'Switzerland', 'Zurich'),
 ('000000005', datetime.timedelta(seconds=72000), 5, '000000018', 'map-swiss-night-attractions.pdf', 'Night Attractions of Switzerland', 'ATTRACTION', datetime.date(2024, 6, 6), 'SIGHTSEEING', 'Switzerland Night Market', 'switz zurich street 10', 'Switzerland', 'Zurich'),
 ('000000005', datetime.timedelta(seconds=72000), 5, '000000019', 'map-swiss-bus-timings.pdf', 'Bus availability Switzerland', 'TRANSPORT', datetime.date(2024, 6, 6), 'SIGHTSEEING', 'Switzerland Night Market', 'switz zurich street 10', 'Switzerland', 'Zurich'),
 ('000000005', datetime.timedelta(seconds=30600), 6, '000000020', 'map-accelerator-layout-cern.pdf', 'Accelerator Layout for CERN', 'OTHERS', datetime.date(2024, 6, 7), 'TOUR', 'Accelerator Tour', 'avenue 110', 'Switzerland', 'Zurich')]

In [30]:
%%sql
create trigger insert_vacation
after insert on vacation
for each row update user 
set upg_count = upg_count + 1
where user_id = new.upg_user_id
;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [33]:
%%sql
create trigger update_vacation
after update on vacation
for each row 
update user 
set upg_count = upg_count + 1
where (((old.upg_user_id <> new.upg_user_id) or (old.upg_user_id is null)) and (user_id = new.upg_user_id));

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [38]:
%%sql
create trigger insert_vac_grp
after insert on vac_user_in
for each row 
update user 
set grp_count = grp_count + 1
where (user_id = new.user_id);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

##### User Info Page

<img src="screenshots/login.png">

<img src="screenshots/sign_up.png">

<img src="screenshots/logged_profile.png">

##### Search and Browse Page

<img src="screenshots/logged_planning_itinerary_map.png">

<img src="screenshots/logged_home.png">

The vacations page also serves as a dashboard for logged in users which only the user can view. This page consists of all the vacations the user participates in.

This page includes the search and browse, only logged in information and the add/update/delete functions.

##### Pages to demo Create, Update and Delete Functions

<img src="screenshots/logged_planning_budget.png">

<img src="screenshots/logged_planning_budget_add.png">